<?php

return [
    '100'  => 'عملیات موفقیت آمیز بود',
    '101'  => 'عملیات موفقیت آمیز بود ولی قبلا عملیات تایید پرداخت آن انجام شده است',

    '-1'   => 'اطلاعات ارسال شده ناقص است',
    '-2'   => 'مرچنت آی دی یا آی پی پذیرنده صحیح نیست',
    '-3'   => 'میزان مبلغ باید بالای 100 تومان باشد',
    '-4'   => 'سطح تایید پذیرنده پایین تر از نقره ای است',
    '-11'  => 'درخواست پیدا نشد',
    '-12'  => 'امکان ویرایش درخواست وجود ندارد',
    '-21'  => 'هیچ نوع عملیات مالی برای این تراکنش یافت نشد',
    '-22'  => 'تراکنش ناموفق می باشد',
    '-33'  => 'میزان مبلغ تراکنش با مبلغ پرداختی مطابقت ندارد',
    '-34'  => 'سقف تقسیم تراکنش از لحاظ تعداد یا رقم، عبور نموده است',
    '-40'  => 'اجازه دسترسی به متد مربوطه وجود ندارد',
    '-41'  => 'اطلاعات ارسال شده مربوط به داده اضافی، نامعتبر است',
    '-42'  => 'شناسه پرداخت نامعتبر است',
    '-54'  => 'درخواست آرشیو شده است',

    '-101' => 'پرداخت ناموفق بوده است',
    '-202' => 'پاسخی از طرف زرین پال ارسال نشد',
    '-303' => 'پاسخی از طرف زرین پال ارسال نشد',

];
